{
  "headline": "Open source",
  "copy": "Below is a list of some of my open source projects and contributions. There are many other projects on GitHub which are not listed here. So if you're interested in some more projects, please have a look at my GitHub profile page.",
  "projects": [
    {
      "name": "Routz",
      "details": "This small project is built out of a pattern, that I've used in several projects before. I saw a need to publish this as a separate module. It's defining routes of an application in a single place to prevent repetitive usage by exposing helper functions. The name of this project is Routz and pronounced as ”Routes” (/ɹuːts/).",
      "url": "https://github.com/schorfES/routz",
      "url_label": "Visit on GitHub"
    },
    {
      "name": "CarouCSSel",
      "details": "CarouCSSel is a lightweight dependency-free css carousel for horizontal scrolling. It's shipped with a javascript api to render for example ui elements like buttons and pagination to control the scroll position.",
      "url": "https://github.com/schorfES/caroucssel",
      "url_label": "Visit on GitHub"
    },
    {
      "name": "Pacto",
      "details": "Pacto is a lightweight framework for non SPA websites including small features which use latest browser features like Proxy, IntersectionObserver and WeakMap. This website is based on pacto. To read more about the concepts behind pacto, please visit the GitHub project.",
      "url": "https://github.com/schorfES/pacto",
      "url_label": "Visit on GitHub"
    },
    {
      "name": "Lintspaces",
      "details": "Lintspaces or better ”node-lintspaces” is a javascript module for checking different types of spaces in a source code. It validates a lot of different types like indentation, trailing whitespace, new line at end of file and some more. It respects team or project settings defined in .editorconfig and/or .lintspacesrc. ”node-linstpaces” is the core which other open source tools like ”lintspaces-cli” by Evan Shortiss, ”gulp-lintspaces” by Alberto Elias and ”grunt-lintspaces” are based on.",
      "url": "https://github.com/schorfES/node-lintspaces",
      "url_label": "Visit on GitHub"
    },
    {
      "name": "Grunt Lintspaces",
      "details": "This is the grunt plugin based on the ”node-lintspaces” core validation module.",
      "url": "https://github.com/schorfES/grunt-lintspaces",
      "url_label": "Visit on GitHub"
    }
  ]
}
